.rocket.d/.emacs.d/config.org
#+TITLE: Rocket's Emacs Config
#+AUTHOR: Rohit Koneru

* PACKAGE MANAGEMENT
** Setup package.el to work with MELPA
   #+begin_src emacs-lisp
     (require 'package)
     (add-to-list 'package-archives
                  '("melpa" . "https://melpa.org/packages/"))
     (package-refresh-contents)
     (package-initialize)
   #+end_src
** Install use-package
   #+begin_src emacs-lisp
     (unless (package-installed-p 'use-package)
     (package-install 'use-package))
     (require 'use-package-ensure)
     (setq use-package-always-ensure t)
   #+end_src
** Load Path
   Add load_path directory to load-path.
   #+begin_src emacs-lisp
     (add-to-list 'load-path "~/.rocket.d/load_path/")
   #+end_src
   
* EVIL MODE
  #+begin_src emacs-lisp
  (use-package evil
  :init      ;; tweak evil's configuration before loading it
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode))
  (use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer))
  (evil-collection-init))
  #+end_src
** Undo and redo functionality
	 Installing undo-tree and making evil work with it.
	 #+begin_src emacs-lisp
           (use-package undo-tree)
           (global-undo-tree-mode)
           (setq evil-undo-system 'undo-tree)
	 #+end_src

* SOME UTILS
** Benchmark-Init
	 #+begin_src emacs-lisp
(use-package benchmark-init
  :ensure t
  :config
  ;; To disable collection of benchmark data after init is done.
  (add-hook 'after-init-hook 'benchmark-init/deactivate))
	 #+end_src

* GENERAL KEYBINDINGS
  #+begin_src emacs-lisp
    (use-package general
       :config (general-evil-setup t))
  #+end_src
** Common Bindings
commonly used bindings
#+begin_src emacs-lisp
  (nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
    "SPC"   '(execute-extended-command :which-key "M-x")
    "."     '(find-file :which-key "Find file")
    "h r r" '((lambda () (interactive) (load-file "~/.rocket.d/init.el")) :which-key "Reload emacs config")
    "t t"   '(toggle-truncate-lines :which-key "Toggle truncate lines"))
#+end_src
** Buffers
   Keybindings for working with buffers.
   #+begin_src emacs-lisp
     (nvmap :prefix "SPC"
       "b b"   '(ibuffer :which-key "Ibuffer")
       "b s"   '(switch-to-buffer :which-key "Ibuffer")
       "b c"   '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
       "b k"   '(kill-current-buffer :which-key "Kill current buffer")
       "b n"   '(next-buffer :which-key "Next buffer")
       "b p"   '(previous-buffer :which-key "Previous buffer")
       "b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
       "b f"   '(lsp-format-buffer :which-key "format buffer using LSP")
       "b K"   '(kill-buffer :which-key "Kill buffer"))
   #+end_src
** Window Controls
   Keybindings for working with windows/splits.
   #+begin_src emacs-lisp
     (nvmap :prefix "SPC"
       ;; Window splits
       "w c"   '(evil-window-delete :which-key "Close window")
       "w n"   '(evil-window-new :which-key "New window")
       "w s"   '(evil-window-split :which-key "Horizontal split window")
       "w v"   '(evil-window-vsplit :which-key "Vertical split window")
       ;; Window motions
       "w h"   '(evil-window-left :which-key "Window left")
       "w j"   '(evil-window-down :which-key "Window down")
       "w k"   '(evil-window-up :which-key "Window up")
       "w l"   '(evil-window-right :which-key "Window right")
       "w w"   '(evil-window-next :which-key "Goto next window"))
   #+end_src
** Language Bindings
   #+begin_src emacs-lisp
   ;; function that sends an r to a buffer named "vterm-flutter", which reloads when flutter run is being run.
   (defun flutter-reload () (interactive) (progn (set-buffer "vterm-flutter") (term-send-raw-string "r\n")))
   (nvmap :prefix "SPC"
     "r"   '(flutter-reload :which-key "reload flutter when flutter run is being run in vterm"))
   #+end_src
** Opening Things
   Open vterm with SPC o t
   #+begin_src emacs-lisp
   (nvmap :prefix "SPC"
     "o t"   '(vterm :which-key "Open vterm"))
   #+end_src

* DOOM THEMES
  #+begin_src emacs-lisp
    (use-package doom-themes)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
       doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)
  #+end_src

* FONTS
  Sets fonts in emacs. Also makes fonts look good in the emacsclient.
  #+begin_src emacs-lisp
		 (set-face-attribute 'default nil
		 :font "Jetbrains Mono"
		 :height 145
		 :weight 'medium)
		 (set-face-attribute 'variable-pitch nil
		 :font "Ubuntu Mono Nerd Font"
		 :height 155
		 :weight 'medium)
		 (set-face-attribute 'fixed-pitch nil
		 :font "Jetbrains Mono"
		 :height 145
		 :weight 'medium)
		 ;; Makes commented text and keywords italics.
		 ;; This is working in emacsclient but not emacs.
		 ;; Your font must have an italic face available.
		 (set-face-attribute 'font-lock-comment-face nil
		 :slant 'italic)
		 (set-face-attribute 'font-lock-keyword-face nil
		 :slant 'italic)

		 ;; Uncomment the following line if line spacing needs adjusting.
		 ;;(setq-default line-spacing 0.12)

		 ;; changes certain keywords to symbols, such as lamda!
		 (setq global-prettify-symbols-mode t)

	 (defconst jetbrains-ligature-mode--ligatures
		  '("->" "<-" "<=>" "==" "!=" "<=" ">=" "=:=" "!==" "===" "++" "=>"))

	 (sort jetbrains-ligature-mode--ligatures (lambda (x y) (> (length x) (length y))))

	 (dolist (pat jetbrains-ligature-mode--ligatures)
		 (set-char-table-range composition-function-table
												 (aref pat 0)
												 (nconc (char-table-range composition-function-table (aref pat 0))
															  (list (vector (regexp-quote pat)
																						  0
																			 'compose-gstring-for-graphic)))))
  #+end_src

  #+RESULTS:

** Zooming in and out
   Allows zooming in and out with control = and control - respectively. Scroll wheel can also be used.
   #+begin_src emacs-lisp
    (global-set-key (kbd "C-=") 'text-scale-increase)
    (global-set-key (kbd "C--") 'text-scale-decrease)
    (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
    (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
   #+end_src

* ALL THE ICONS
This is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

* GUI SETTINGS
** Common Settings
    Common settings for changing the look of the app.
    Removing menubar, toolbar and scrollbar.
    #+begin_src emacs-lisp
      (menu-bar-mode -1)
      (tool-bar-mode -1)
      (scroll-bar-mode -1)
    #+end_src
** Line numbers and truncate lines
   #+begin_src emacs-lisp
     (global-display-line-numbers-mode 1)
     (global-visual-line-mode t)
   #+end_src
** Modeline
   Setting up the modeline in emacs using the Doom modeline.
   #+begin_src emacs-lisp
     (use-package doom-modeline)
     (doom-modeline-mode 1)
   #+end_src
** Scrolling
   Smooth scrolling. Scrolling speed also changed.
   #+begin_src emacs-lisp
    (setq scroll-conservatively 101) ;; value greater than 100 gets rid of half page jumping
    (setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; how many lines at a time
    (setq mouse-wheel-progressive-speed t) ;; accelerate scrolling
    (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
   #+end_src
** Highlight Indent Guides 
   highlightes indentation. Set to > for each level of indent.
   #+begin_src emacs-lisp
     (use-package highlight-indent-guides
     :commands highlight-indent-guides-mode
     :hook (prog-mode . highlight-indent-guides-mode)
     :config
     (setq highlight-indent-guides-method 'character
	     highlight-indent-guides-character ?>
	     highlight-indent-guides-delay 0.01
	     highlight-indent-guides-responsibe 'top
	     highlight-indent-guides-auto-enabled nil))
   #+end_src

* DASHBOARD
Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.
** Configuring Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Rocket Emacs")
  (setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
  ;;(setq dashboard-startup-banner "/home/dt/.emacs.d/emacs-dash.png")  ;; use custom image as banner
  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 10)
                          (agenda . 10)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
			      (bookmarks . "book"))))
#+end_src
** Dashboard in Emacsclient
This setting ensures that emacsclient always opens on *dashboard* rather than *scratch*.
#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

