.rocket.d/.emacs.d/config.el

(use-package vertico
  :bind (:map vertico-map
	 ("M-j" . vertico-next)
	 ("M-k" . vertico-previous)
	 ("C-f" . vertico-exit)
	 :map minibuffer-local-map
	 ("M-h" . backward-kill-word))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

(use-package savehist
  :init
  (savehist-mode))

(use-package marginalia
  :after vertico
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

(use-package company)

(use-package which-key)
(which-key-mode)

(use-package elfeed
	:config
	(setq elfeed-search-feed-face ":foreground #fff :weight bold")
	(setq elfeed-feeds '(
		("https://www.linuxjournal.com/node/feed" linux linuxjournal articles)
		("https://www.reddit.com/r/emacs.rss" linux emacs reddit)
    ("https://hackaday.com/blog/feed/" hackaday linux)
		("https://opensource.com/feed" opensource linux)
		("https://linux.softpedia.com/backend.xml" softpedia linux)
		("https://itsfoss.com/feed/" itsfoss linux)
		("https://www.phoronix.com/rss.php" phoronix linux)
		("https://www.computerworld.com/index.rss" computerworld linux)
		("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
		("https://betanews.com/feed" betanews linux)
                ("https://reddit.com/r/linuxmasterrace.rss" memes linux reddit)
"https://rss.nytimes.com/services/xml/rss/nyt/Technology.xml"
		("http://lxer.com/module/newswire/headlines.rss" lxer linux))))

 (use-package elfeed-goodies
	 :init
	 (elfeed-goodies/setup)
	 :config
	 (setq elfeed-goodies/entry-pane-size 0.5))

 (add-hook 'elfeed-show-mode-hook 'visual-line-mode)
 (evil-define-key 'normal elfeed-show-mode-map
	 (kbd "J") 'elfeed-goodies/split-show-next
	 (kbd "K") 'elfeed-goodies/split-show-prev)
 (evil-define-key 'normal elfeed-search-mode-map
	 (kbd "J") 'elfeed-goodies/split-show-next
	 (kbd "K") 'elfeed-goodies/split-show-prev)
 (evil-define-key 'normal elfeed-search-mode-map
	 (kbd "RET") 'elfeed-goodies/split-search-show-entry)
 (evil-define-key 'normal elfeed-search-mode-map 
   (kbd "SPC r") 'elfeed-show-visit)

(use-package lsp-mode
:defer t
	 :bind ("C-l" . lsp-mode)
						)

(use-package lsp-ui)

(use-package lsp-dart
:hook (dart-mode . lsp)
:config
(setq lsp-dart-sdk-dir "/home/rohitk/snap/flutter/common/flutter/bin/cache/dart-sdk/")
(setq lsp-enable-links nil))



(use-package web-mode)
(add-to-list 'auto-mode-alist '("\\.ts\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode))

(defun my-web-mode-hook ()
  "Hooks for Web mode."
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
)
(add-hook 'web-mode-hook  'my-web-mode-hook)    
(setq tab-width 2)

(setq web-mode-enable-current-column-highlight t)
(setq web-mode-enable-current-element-highlight t)

(use-package emmet-mode)
(add-hook 'web-mode-hook  'emmet-mode) 
(add-hook 'web-mode-before-auto-complete-hooks
		'(lambda ()
		       (let ((web-mode-cur-language
				(web-mode-language-at-pos)))
							       (if (string= web-mode-cur-language "php")
				       (yas-activate-extra-mode 'php-mode)
				       (yas-deactivate-extra-mode 'php-mode))
							       (if (string= web-mode-cur-language "css")
				       (setq emmet-use-css-transform t)
				       (setq emmet-use-css-transform nil)))))

(use-package haskell-mode)

(defun my-asm-mode-hook ()
;; you can use `comment-dwim' (M-;) for this kind of behaviour anyway
(local-unset-key (vector asm-comment-char))
;; asm-mode sets it locally to nil, to "stay closer to the old TAB behaviour".
(setq tab-always-indent (default-value 'tab-always-indent))
(setq tab-stop-list (number-sequence 0 60 2)))

(add-hook 'asm-mode-hook #'my-asm-mode-hook)

(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred
