.rocket.d/.emacs.d/config.org
** C/C++
   Setting up lsp-mode with C++.
   #+begin_src emacs-lisp
   (add-hook 'c++-mode-hook 'lsp)
   (add-hook 'c-mode-hook 'lsp)
(setq lsp-clients-clangd-args '(
                                  ;; If set to true, code completion will include index symbols that are not defined in the scopes
                                  ;; (e.g. namespaces) visible from the code completion point. Such completions can insert scope qualifiers
                                  "--all-scopes-completion"
                                  ;; Index project code in the background and persist index on disk.
                                  "--background-index"
                                  ;; Enable clang-tidy diagnostics
                                  "--clang-tidy"
                                  ;; Whether the clang-parser is used for code-completion
                                  ;;   Use text-based completion if the parser is not ready (auto)
                                  "--completion-parse=auto"
                                  ;; Granularity of code completion suggestions
                                  ;;   One completion item for each semantically distinct completion, with full type information (detailed)
                                  "--completion-style=detailed"
                                  ;; clang-format style to apply by default when no .clang-format file is found
                                  "--fallback-style=Chromium"
                                  ;; When disabled, completions contain only parentheses for function calls.
                                  ;; When enabled, completions also contain placeholders for method parameters
                                  "--function-arg-placeholders"
                                  ;; Add #include directives when accepting code completions
                                  ;;   Include what you use. Insert the owning header for top-level symbols, unless the
                                  ;;   header is already directly included or the symbol is forward-declared
                                  "--header-insertion=iwyu"
                                  ;; Prepend a circular dot or space before the completion label, depending on whether an include line will be inserted or not
                                  "--header-insertion-decorators"
                                  ;; Enable index-based features. By default, clangd maintains an index built from symbols in opened files.
                                  ;; Global index support needs to enabled separatedly
                                  "--index"
                                  ;; Attempts to fix diagnostic errors caused by missing includes using index
                                  "--suggest-missing-includes"
                                  ;; Number of async workers used by clangd. Background index also uses this many workers.
                                  "-j=4"
                                  ))
   #+end_src
   

* ORG MODE
  Setting the default org directory.
  #+begin_src emacs-lisp
    (setq org-directory "~/Documents/org/")
  #+end_src
# ** Org Agenda
#    Set file for org agenda.
#    Set keywords for todos.
#    #+begin_src emacs-lisp
# 	 (after! org
# 	 (setq org-agenda-files '("~/Documents/org/todo.org"))
# 	 (setq org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
# 		 '((sequence
# 				 "DOING(c)"          ; A task that is in progress
#          "TODO(t)"           ; Just other stuff
# 				 "PROJ(p)"           ; A project that contains other tasks
# 				 "SCHOOL(s)"         ; A task for school
# 				 "DEV(d)"            ; A task for a dev project
# 				 "IDEA(i)"
# 				 "EVENT(e)"
# 				 "WAIT(w)"           ; Something is holding up this task
# 				 "|"                 ; The pipe necessary to separate "active" states and "inactive" states
# 				 "DONE(D)" ))))          ; Task has been completed
#   #+end_src
# ** Org Superstar
#    Fancy bullet points instead of *s in org mode.
#    #+begin_src emacs-lisp
# 	   (use-package org-superstar)
# 		 (after! org
#        (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
#    #+end_src
	 
** Source Code Block Syntax Highlighting
   We want the same syntax highlighting in source blocks as in the native language files.

   #+begin_src emacs-lisp
   (setq org-src-fontify-natively t
       org-src-tab-acts-natively t
       org-confirm-babel-evaluate nil
       org-edit-src-content-indentation 0)
   #+end_src

* PROJECTILE
#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-global-mode 1))
#+end_src
Setting directories where projectile will look for projects.
#+begin_src emacs-lisp
(setq projectile-project-search-path '("~/Documents/"))
#+end_src

* SHELLS
** Vterm
   Installs vterm, a terminal emulator for emacs.
   #+begin_src emacs-lisp
   (use-package vterm)
   #+end_src

